--Переключине на созданную бд
USE ChildrenCamp;

--Заполнение таблиц
INSERT Transports
VALUES ('Автобус', '13:00'),
	   ('Маршрутка', '14:14'),
	   ('Автобус-маршрутка', '15:11'),
	   ('Велосипед', '17:24'),
	   ('Маршрутка', '12:00')

INSERT Squads
VALUES ('Отряд Солнышки', 'Все счастливые'),
	   ('Отряд Луна',      NULL),
	   ('Отряд Рыбки',    'От всех воняет'),
	   ('Отряд Роботы',   'Все умные'),
	   ('Отряд Силачи',   'Все сильные'),
	   ('Отряд Гепарды',  'Все сильные'),
	   ('Отряд Остальные','Те, кто остался')

INSERT Sections
VALUES ('Плавание',		    'Какая-то ссылка'),
	   ('Бокс',				'Какая-то ссылка'),
	   ('Шахматы',			'Какая-то ссылка'),
	   ('Бег',			    'Какая-то ссылка'),
	   ('Вышивание',        'Какая-то ссылка'),
	   ('Программирование', 'Какая-то ссылка')

INSERT SquadSections
VALUES (1, 1),
	   (2, 2),
	   (3, 3),
	   (4, 4),
	   (5, 5),
	   (6, 6),
	   (6, 7)

INSERT Housings
VALUES ('Одноэтажный деревянный', 'Публичный дом',        100, 1),
	   ('Двухэтажный деревяный',  'Непубличный дом',      110, 2),
	   ('Одноэтажный панельный',  'Красивый дом',         210, 3),
	   ('Двухэтажный панельный',  'Очень красивый домик', 220, 4),
	   ('Просторный',             'Аквариум',             310, 5),
	   ('Тесный',				  'Аквариум',             320, 6),
	   ('Перевернутый',			  'Санузел',              333, 7)

INSERT CampEmployees
VALUES ('Антонов Антон Антонович',      'Портфолио1',  'Вожатый',       1,     NULL,	 1),
	   ('Воронцов Игорь Владимирович',  'Портфолио2',  'Вожатый',		2,     NULL,	 1),
	   ('Красненкова Анна Анатольевна', 'Портфолио3',  'Вожатый',		3,     NULL,	 1),
	   ('Самойлов Стас Никитич',        'Портфолио4',  'Вожатый',		4,     NULL,	 1),
	   ('Татарян Генадий Татарич',      'Портфолио5',  'Вожатый',		5,     NULL,	 1),
	   ('Григорьев Гриша Григич',       'Портфолио6',  'Вожатый',		6,     NULL,	 1),
	   ('Чекулаев Дмитрий Никитич',     'Портфолио7',  'Вожатый',		7,     NULL,	 1),
	   ('Семенова Наталья Игоревна',    'Портфолио8',  'Повар',			NULL,  NULL,	 5),
	   ('Крышин Денис Викторович',      'Портфолио9',  'Повар',			NULL,  NULL,	 5),
	   ('Самолетов Данат Викторович',   'Портфолио10', 'Водитель',		NULL,  1,		 2),
	   ('Беликов Роман Константинович', 'Портфолио11', 'Водитель',		NULL,  2,		 2),
	   ('Кузина Василиса Алексеевна',   'Портфолио12', 'Водитель',		NULL,  3,		 2),
	   ('Чернов Гордей Максимович',     'Портфолио13', 'Директор',      NULL,  4,	     2),
	   ('Тихонов Дмитрий Романович',    'Портфолио14', 'Администратор', NULL,  NULL,     3),
	   ('Соколова Екатерина Артуровна', 'Портфолио15', 'Администратор', NULL,  NULL,     3)

INSERT Inventory
VALUES ('Консервы', '2025.12.12'),
	   ('Лампы',    NULL),
	   ('Реквизит', NULL),
	   ('Мебель',   NULL),
	   ('Одежда',   NULL),
	   ('Морковка', '2020.11.12')

INSERT HousingInventory
VALUES ('2015.12.12', 1, 1),
       ('2222.11.12', 2, 2),
	   ('2123.10.06', 3, 3),
	   ('2000.10.03', 4, 4),
	   ('2013.12.07', 5, 5)

INSERT CampEvents
VALUES ('Праздник любви',                       '2015.11.11', 'Центральное окно'),
	   ('Праздник спорта',                      '2015.12.11', 'Спортзал'),
	   ('Масленница',                           '2015.10.10', 'Рядом с главным корпусом'),
	   ('Праздник первенства на соревнованиях', '2015.05.11', 'Рядом с главным корпусом'),
	   ('День рождение Стаса',                  '2015.01.11', 'Домик 1'),
	   ('Праздник новолуния',                   '2015.11.12', 'Спортзал')

INSERT EventInventory
VALUES (1, 1),
	   (4, 2),
	   (5, 6),
	   (2, 4)

INSERT SectionEmployees
VALUES (1, 1),
	   (2, 2),
	   (3, 3),
	   (4, 4),
	   (5, 5)

INSERT Parents
VALUES ('Дьяков Даниил Сергеевич',      '4772 119926', '+7(159)252-49-38'),
	   ('Елисеева София Никитична',     '4460 324531', '+7(85)996-58-00'),
	   ('Ермаков Георгий Даниилович',   '4555 515150', '+7(08)944-89-53'),
	   ('Зайцев Иван Даниилович',       '4264 460950', '+7(4970)782-71-54'),
	   ('Ильин Тимур Иванович',         '4332 865149', '+7(7558)480-12-76'),
	   ('Капустин Тимофей Романович',   '4723 668396', '+7(5408)475-39-89'),
	   ('Климов Максим Александрович',  '4564 436107', '+7(63)894-46-90'),
	   ('Иванова Александра Евгеньевна','4826 725922', '+7(57)657-40-25')

INSERT Trips
VALUES ('2022.10.06', '2023.10.06', 14, 1),
	   ('2022.03.29', '2023.03.29', 14, 2),
	   ('2022.05.29', '2023.05.29', 14, 3),
	   ('2022.01.22', '2023.01.22', 14, 4),
	   ('2022.08.12', '2023.08.12', 15, 5),
	   ('2022.11.11', '2023.11.11', 15, 6),
	   ('2022.08.27', '2023.08.27', 15, 7),
	   ('2022.12.29', '2023.12.29', 14, 8)

INSERT Children
VALUES ('Медведев Макар Владимирович', '2009.10.22', 1, 1),
	   ('Левин Алексей Ильич',         '2010.11.12', 2, 2),
	   ('Логинова Кира Максимовна',    '2013.04.27', 3, 3),
	   ('Майоров Даниил Кириллович',   '2015.07.25', 4, 4),
	   ('Матвеев Матвей Михайлович',   '2009.06.20', 5, 5),
	   ('Кочетков Егор Михайлович',    '2013.08.02', 6, 6),
	   ('Егоров Александр Максимович', '2007.11.19', 7, 7),
	   ('Чернов Гордей Максимович',    '2006.06.13', 7, 8)

INSERT ChildrenParents
VALUES (1, 1),
	   (2, 2),
	   (3, 3),
	   (4, 4),
	   (5, 5),
	   (6, 6),
	   (7, 7),
	   (8, 8)

INSERT EventMembers
VALUES (1, 1, 'Выступает в сценке'),
       (2, 2, 'Носит реквизит'),
	   (3, 3, 'Моет посуду'),
	   (4, 4, 'Развлекается'),
	   (5, 5, 'Выступает в сценке'),
	   (6, 6, 'Носит реквизит'),
	   (6, 7, 'Моет посуду'),
	   (1, 8, 'Развлекается')

INSERT EventEmployees
VALUES (1, 1, 'Следит за порядком'),
	   (1, 2, 'Караулит вход'),
	   (2, 3, 'Караулит вход'),
	   (2, 4, 'Следит за порядком'),
	   (4, 5, 'Развлекается'),
	   (5, 6, 'Следит за порядком'),
	   (6, 5, 'Выпивает'),
	   (7, 6, 'Развлекается')

--Вывод таблиц
SELECT * FROM Transports	

SELECT * FROM EventEmployees

SELECT * FROM Squads

SELECT * FROM Sections

SELECT * FROM SquadSections 

SELECT * FROM Housings

SELECT * FROM CampEmployees

SELECT * FROM Inventory

SELECT * FROM HousingInventory

SELECT * FROM CampEvents

SELECT * FROM EventInventory

SELECT * FROM SectionEmployees

SELECT * FROM Parents

SELECT * FROM Trips

SELECT * FROM Children

SELECT * FROM ChildrenParents

SELECT * FROM EventMembers

--Вызов процедур
EXEC ShowSquadMembersAndSquadLeaders;

DECLARE @Result NVARCHAR(70);
EXEC ChangeSquadLeaderSquadCode 1, 2, @Result OUTPUT;
SELECT @Result as Result;

EXEC GetChildrenFullNameFullAge;

EXEC InsertRowsFromFile 'C:\Users\voron\Downloads\FileForInsert.txt', 'Transports'

--Вызов представления
SELECT * FROM ChildrensHousing;

--Полезные запросы
SELECT DP1.name AS DatabaseRoleName,   
       ISNULL (DP2.name, 'No members') AS DatabaseUserName   
FROM sys.database_role_members AS DRM  
RIGHT OUTER JOIN sys.database_principals AS DP1 ON DRM.role_principal_id = DP1.principal_id  
LEFT OUTER JOIN sys.database_principals AS DP2 ON DRM.member_principal_id = DP2.principal_id  
WHERE DP1.type = 'R'
ORDER BY DP1.name; 

SELECT pr.type_desc,
	   pr.name,
       ISNULL(pe.state_desc, 'No permission statements') AS state_desc,
       ISNULL(pe.permission_name, 'No permission statements') AS permission_name
FROM sys.database_principals AS pr
LEFT JOIN sys.database_permissions AS pe ON pr.principal_id = pe.grantee_principal_id
WHERE pr.is_fixed_role = 0
ORDER BY pr.name, type_desc;

USE master;